# Task_2 Напишите программу, которая на вход принимает 
# 5 чисел и находит максимальное из них.
# Примеры:   - 1, 4, 8, 7, 5 -> 8
# - 78, 55, 36, 90, 2 -> 90

a = [55,3,7,9,263]  
max = a[0]

for i in a:
    if i > max:
        max = i
print('Max number is  = ',max)

# range(start, stop, step)
# range(5) -> [0, 1, 2, 3, 4]
# range(2, 5) -> [2, 3, 4]
# range(1, 7, 2) -> [1, 3, 5]
           